const express = require('express');
const app = express();
const port = 3001;

const mailBox = {
        0: { box: 'inBox', status: "read", id: 0, sender: "Иван", date: (new Date('April 13, 2022 03:24:51')).toLocaleString(), theme: "Работа", message: "Предлагаем Вам высокооплачиваемую ночную работу курьером" },
        1: { box: 'inBox', status: "unread", id: 1, sender: "Петр", date: (new Date('April 13, 2022 09:34:24')).toLocaleString(), theme: "Мирозайм", message: "Получите деньги под залог жилья уже сегодня всего под 1000% в сутки" },
        2: { box: 'inBox', status: "read", id: 2, sender: "Мария", date: (new Date('April 13, 2022 13:59:17')).toLocaleString(), theme: "Реклама", message: "Купите новый крем для увеличения уха" },
        3: { box: 'inBox', status: "unread", id: 3, sender: "Аркадий", date: (new Date('April 13, 2022 19:23:48')).toLocaleString(), theme: "Отпуск", message: "Не забудь обменять валюту" },
        4: { box: 'inBox', status: "read", id: 4, sender: "Михал Палыч Тереньтьев", date: (new Date('April 13, 2022 16:39:18')).toLocaleString(), theme: "Ну что там с деньгами", message: "да аллё да-да ну как там с деньгами? а? как с деньгами то там? че с деньгами? чее? куда ты звонишь? тебе звоню кому? ну тебе кому тебе? а вот тебе вот ты кто такой? Михал Палыч Какой Михал Палыч? Тереньтьев Такого не знаю, ты ошибся номером, друг... Кто? Ты Чо с деньгами? С какими деньгами? Ну которые я внес в капитал куда? в капитал прожи... прожиточного минимума ты пьяный или кто? ... я тре...я Михал Палыч Тереньтьев кто такой? пьяный вот именно ...ну и все! завяжи лямку, ебана в рот куда.. чего завязать? завяжи лямку! а че ты кричишь? да ничего алле да ну че там? чего? как с деньгами обстоят...обстоят вопрос? с какими деньгами? которые я вложи в капитал в какой капитал? прожиточного минимума какой? в смысле 'в какой'??? ты куда звонишь?! По какому номеру звонишь?! по твоему номеру эй сынок! че сынок ебаный!! че ты куда звонишь!!! че ты кричишь? по какому телефону звонишь?! 22505 ну, какой капитал? пидор ты ебаный!! прожиточного минимума ну, прожиточного ну а че ты кричишь? да нихуя! а то соплю разобью тебе нахуй, сопляк ебаный ты чо? ты понял, да?!!! нни... я не понимаю ку... все, заткнись нахуй алле пидарас ебаный! а че я? ты приедь сюда, я тебе бошку отверну!!!! а какой адрес? вот приедь сюда - я тебе бошку отверну, сопляк ебаный!!!! да не надо ты понял, да?!!! за что? за все а че я сделал? сынок ебаный!!! че с деньгами? ты понял меня?!!!! че с деньгами, я спрашиваю? вот все, какие-то деньги, ебаный пидарас! кто? ты!!! почему? все, заткнись! алле, алл.. я сейчас узнаю с какого ты телефона звонишь! я звоню щас из офиса с какого офиса?! находящегося по улице Красноармейская 4 вот номер мне твой телефона скажи мне! алле скажи номер телефона своего! зачем? а чтоб я приехал тебе моську набил нахуй!! за что это? а за все, ты понял, да?! ничего не понял я тебе сказал, сынок! что? ты понял меня?! папа все!! что все то? ты давай номер телефона или сюда приезжай!! а с деньгами как вопрос обстоит? с какими деньгами??! которые я вложил куда ты вложил??!!! в капитал какой??!! прожиточного минимума пидарас ебаный!!!! что?" },
        5: { box: 'inBox', status: "unread", id: 5, sender: "Идущий к Реке", date: (new Date('April 13, 2022 23:12:52')).toLocaleString(), theme: "Монолог", message: "Я в своем познании настолько преисполнился, что я как будто бы уже сто триллионов миллиардов лет проживаю на триллионах и триллионах таких же планет, как эта Земля, мне этот мир абсолютно понятен, и я здесь ищу только одного - покоя, умиротворения и вот этой гармонии, от слияния с бесконечно вечным, от созерцания великого фрактального подобия и от вот этого замечательного всеединства существа, бесконечно вечного, куда ни посмотри, хоть вглубь - бесконечно малое, хоть ввысь - бесконечное большое, понимаешь? А ты мне опять со своим вот этим, иди суетись дальше, это твоё распределение, это твой путь и твой горизонт познания и ощущения твоей природы, он несоизмеримо мелок по сравнению с моим, понимаешь? Я как будто бы уже давно глубокий старец, бессмертный, ну или там уже почти бессмертный, который на этой планете от её самого зарождения, ещё когда только Солнце только-только сформировалось как звезда, и вот это газопылевое облако, вот, после взрыва, Солнца, когда оно вспыхнуло, как звезда, начало формировать вот эти коацерваты, планеты, понимаешь, я на этой Земле уже как будто почти пять миллиардов лет живу и знаю её вдоль и поперёк этот весь мир, а ты мне какие-то... мне не важно на твои тачки, на твои яхты, на твои квартиры, там, на твоё благо. Я был на этой планете бесконечным множеством, и круче Цезаря, и круче Гитлера, и круче всех великих, понимаешь, был, а где-то был конченым говном, ещё хуже, чем здесь. Я множество этих состояний чувствую. Где-то я был больше подобен растению, где-то я больше был подобен птице, там, червю, где-то был просто сгусток камня, это всё есть душа, понимаешь? Она имеет грани подобия совершенно многообразные, бесконечное множество. Но тебе этого не понять, поэтому ты езжай себе , мы в этом мире как бы живем разными ощущениями и разными стремлениями, соответственно, разное наше и место, разное и наше распределение. Тебе я желаю все самые крутые тачки чтоб были у тебя, и все самые лучше самки, если мало идей, обращайся ко мне, я тебе на каждую твою идею предложу сотню триллионов, как всё делать. Ну а я всё, я иду как глубокий старец,узревший вечное, прикоснувшийся к Божественному, сам стал богоподобен и устремлен в это бесконечное, и который в умиротворении, покое, гармонии, благодати, в этом сокровенном блаженстве пребывает, вовлеченный во всё и во вся, понимаешь, вот и всё, в этом наша разница. Так что я иду любоваться мирозданием, а ты идёшь преисполняться в ГРАНЯХ каких-то, вот и вся разница, понимаешь, ты не зришь это вечное бесконечное, оно тебе не нужно. Ну зато ты, так сказать, более активен, как вот этот дятел долбящий, или муравей, который очень активен в своей стезе, поэтому давай, наши пути здесь, конечно, имеют грани подобия, потому что всё едино, но я-то тебя прекрасно понимаю, а вот ты меня - вряд ли, потому что я как бы тебя в себе содержу, всю твою природу, она составляет одну маленькую там песчиночку, от того что есть во мне, вот и всё, поэтому давай, ступай, езжай, а я пошел наслаждаться прекрасным осенним закатом на берегу теплой южной реки. Всё, ступай, и я пойду." }
}
let index = 6;

const cors = require('cors');
app.use(cors());

app.use(express.json());

app.get('/', (req, res) => {
    res.json( mailBox );
});

app.post('/', (req, res) => {
    const letter = req.body;
    letter.id = index;
    mailBox[index] = letter;
    index++;
    console.log('letter added', letter)
    res.status(200);
    res.send(letter);
});

app.delete('/', (req, res) => {
    const id = req.body.id;
    console.log('letter deleted', mailBox[id]);
    delete mailBox[id];
    res.status(200);
    res.send({id})
})

app.patch('/', (req, res) => {
    const {id, property, value} = req.body;
    const letter = mailBox[id];
    letter[property] = value;
    console.log('letter updated', letter);
    res.status(200);
    res.send(letter);
})

app.listen(port, () => {
    console.log(`Application listening on ${port}!`);
});